DARIA_CHANNEL = "https://t.me/dashafru"

MARA_CHANNEL = "https://t.me/maracharmer"

START_MESSAGE_1 = """Привет, прекрасная леди или восхитительный сэр!🌙

Мы - Дарья Фурман и Мара Charmer приветствуем тебя на перевале, где забывают бывших и вспоминают, как замечательно было говорить "я" вместо "мы" и свистеть проходящим мимо людям с красивыми жопами.

Абсолютно не важно, желаешь ли ты своему бывшему счастья или мечтаешь, чтобы он сгнил в канаве под мостом - мы принимаем людей любого вероисповедания. Здесь никто не будет писать прощальные письма и не отправлять - это вы сами погуглите, плиз."""

START_MESSAGE_2 = """Мы зовём тебя на иммерсивный курс-трансформацию, где будут:

- Теория психоанализа от Даши;
- Комплиментарные эзотерические лекции от Мары;
- Сериал о расставании 'Кто из них я';
- Игровой персонаж, который будет проходить курс вместе с тобой и вести дневник;
- И тусовка, которая в этот же самый момент переживает те же чувства, что и ты.

Даже если и забывать некого, но внутри всё как будто встало на паузу - присоединяйся, тебе точно станет легче. Кризис лучше проходить вместе, а главное - тебя не поглотит предновогодний психоз. Проскочишь все тревожное на спокойном вайбе практик.

Бронируем тебе место?"""


START_MESSAGE = """
Привет, лиминальный путник🌙\n\n
Приветствую тебя на перевале, где забывают бывших и вспоминают, как 
замечательно было говорить "я" вместо "мы" и свистеть проходящим мимо пацанам 
с красивыми жопами.\n\n
Абсолютно не важно, желаешь ли ты своему бывшему счастья или мечтаешь, 
чтобы он сгнил в канаве под мостом через канализационный сток - я принимаю 
людей любого вероисповедания. Здесь никто не будет церемониться с бывшими - 
учиться отпускать, прощать и писать трогательные письма. Это вы сами 
погуглите, плиз.\n\n
Я приглашаю вас в мир юнгианского психоанализа, где мы разберем теорию - 
поговорим об эго, самости и важных архетипах, которые отвечают за выбор 
партнера. Вас ждут практики, целый сезон сериала и мои личные дневники из 
времен, когда я 800 раз сказала "ты меня больше никогда не услышишь!".
А также у нас будет особый блок, в котором Мара расскажет о любовной связи с 
точки зрения эзотерики.\n\n
Будет интереснейшее, а главное - вас не поглотят тревожные наваждения 
предновогоднего психоза. Без шуток. У нас будет крайне спокойно и наполняюще.
"""

PAID_ALREADY_MESSAGE = """
Пирожок, мне, конечно, приятно, что пытаешься забросать меня деньгами, но потратить их лучше на психолога. Твой доступ уже оплачен 😏\n
А если потерялась ссылка, то вот она: \n{link}
"""

PAYMENT_MESSAGE = """
Понимание, сестра.\n\n
Стоимость курса - {price_basic} рублей\n\n
Опциональный вариант с ништяками - {price_premium} рублей.\n\n
После оплаты я пришлю ссылку к группе и чату.
"""

CHANNEL_INVITE_LINK_MESSAGE  = """
Вот твоя ссылка на канал:\n
{channel_link}
"""

PAYMENT_SUCCESS_MESSAGE = """
Поздравляю, богиня! Шаг вперед сделан.\n
Кстати, я пошептала, чтобы у него перестала усваиваться лактоза. Не за что!
{channel_link}
И да - ты молодец. Серьезно.
"""

REMINDER_24H_MESSAGE = """
Хэй! Бывший не ждет, а вот я - да) Как насчет оставить ненужное в прошлом 
и стать еще ближе с собой?\n\n
No pressure, просто волнуюсь - вдруг ты отвлеклась.\n\n
Кстати - в моем боте можно рандомно оскорбить бывшего. Наслаждайся!
"""

REMINDER_72H_MESSAGE = """
Привет!\n\n
Знаю - ты в раздумьях. Иногда решение занимает время.\n\n
Не торопись. Возможно, сейчас у тебя другие цели.\n\n
Но пока можешь посмотреть, какое оскорбление твоему бывшему выдаст тебе судьба.
"""

PAYMENT_ERROR_MESSAGE = """
Что-то пошло не так с оплатой... Уверена, что это минус вайб твоего бывшего 
ерепенится! Но ничего - попробуй еще раз. Если вдруг не получится - напиши 
на почту.\n\n
Не сдавайся!
"""

GENDER_SELECTION_MESSAGE = """
Какого пола твой бывший? У меня всего два, не обессудь.
"""

INSULT_LIMIT_MESSAGE = """
Лимит на сегодня исчерпан! Приходи завтра за новой порцией 😈
"""
