DARIA_CHANNEL = "https://t.me/dashafru"

MARA_CHANNEL = "https://t.me/maracharmer"

START_MESSAGE_1 = """Привет, прекрасная леди или восхитительный сэр!🌙

Мы - Дарья Фурман и Мара Charmer приветствуем тебя на перевале, где забывают бывших и вспоминают, как замечательно было говорить "я" вместо "мы" и свистеть проходящим мимо людям с красивыми жопами.

Абсолютно не важно, желаешь ли ты своему бывшему счастья или мечтаешь, чтобы он сгнил в канаве под мостом - мы принимаем людей любого вероисповедания. Здесь никто не будет писать прощальные письма и не отправлять - это вы сами погуглите, плиз."""

START_MESSAGE_2 = """Мы зовём тебя на иммерсивный курс-трансформацию, где будут:

- Теория психоанализа от Даши;
- Комплиментарные эзотерические лекции от Мары;
- Сериал о расставании 'Кто из них я';
- Игровой персонаж, который будет проходить курс вместе с тобой и вести дневник;
- И тусовка, которая в этот же самый момент переживает те же чувства, что и ты.

Даже если и забывать некого, но внутри всё как будто встало на паузу - присоединяйся, тебе точно станет легче. Кризис лучше проходить вместе, а главное - тебя не поглотит предновогодний психоз. Проскочишь все тревожное на спокойном вайбе практик.

Бронируем тебе место?"""

START_SPECIAL_MESSAGE = """
Встречайте закрытый праздничный сезон ‘12 дней Нового года’!🎊

Это уже традиционный комедийный иммерсив с персонажами, в котором вы являетесь полноправным участником сюжета. 

Что вас ждет?

📆12 серий о 12 днях, как о микро-модели года, в которой девчонки будут вместе с вами суетить и настраивать сферы своей жизни. В этом году я добавила ежедневный календарь как с религиозными, так и с бытовыми ритуалами, приметами, запретами и забавными традициями со всего мира. Можете следовать, можете хихикать, можете обнаружить, что вы вообще буддист. Сезон идет в закрытом канале с чатом для общения. Старт 1 января.

➕ Традиционная распродажа предыдущих specials по сладчайшим ценам. Вы получаете доступ к каналу, где можно просмотреть все материалы:

🎄New Year special - это мой первый иммерсив на 9 серий про Новый год. Там есть абсолютно все персонажи проекта, драка между двумя самыми дерзкими, а еще вас разденут и заценят ваши буфера (без шуток).

❤️Valentine special - это праздничные поиски мужчины на 9 серий, где вы, как зритель, тоже включены. Паника, уходящие поезда и отчаянные меры. Бонус: список помад всех персонажей)

Оплачивая покупку, вы соглашаетесь с <a href='{offer}'>Публичной офертой</a> и <a href='{privacy}'>Политикой конфиденциальности</a>.

До встречи!
"""

SPECIAL_CHOOSE_MESSAGE = """
Привет, пирожок!\nВыбирай развлечение на месяц 👌🏻
"""

SPECIAL_ALL_BOUGHT = """
Ну что за пирожок!❤️
У тебя уже есть все специальные выпуски, покупать больше нечего) с Наступающим!
"""

PAID_ALREADY_MESSAGE = """
Пирожок, мы, конечно, обожаем, когда нас закидывают деньгами, но твой доступ уже оплачен 😏 Сходи и купи себе помаду, или - если в помаде мужики засмеют - то купи помаду кому-нибудь другому.
А если потерялась ссылка, то вот она:\n\n{link}
"""

PAYMENT_MESSAGE = """
Понимание, дружочек.\n
Стоимость курса для самостоятельного прохождения - {price_basic} рублей.\n
Курс с оффлайн-выпускным в магическом магазине с Марой и Дашей, где можно будет прослушать финальную лекцию, задать все вопросы, а ещё выпить денежного кофе или земного игристого накатить - {price_premium} рублей.\n
После оплаты тебе придет ссылка для вступления в группу с материалами и чат для общения.
"""

CHANNEL_INVITE_LINK_MESSAGE  = """
Вот твоя ссылка на канал:\n
<a href='{channel_link}'>Жми скорее!</a>
"""

PAYMENT_SUCCESS_MESSAGE = """
Поздравляю, богиня! Шаг вперед сделан.\n
Кстати, я пошептала, чтобы у него перестала усваиваться лактоза. Не за что!
{channel_link}
И да - ты молодец. Серьезно.
"""

REMINDER_24H_MESSAGE = """
Хэй! Бывший не ждет, а вот я - да) Как насчет оставить ненужное в прошлом 
и стать еще ближе с собой?\n\n
No pressure, просто волнуюсь - вдруг ты отвлеклась.\n\n
Кстати - в моем боте можно рандомно оскорбить бывшего. Наслаждайся!
"""

REMINDER_72H_MESSAGE = """
Привет!\n\n
Знаю - ты в раздумьях. Иногда решение занимает время.\n\n
Не торопись. Возможно, сейчас у тебя другие цели.\n\n
Но пока можешь посмотреть, какое оскорбление твоему бывшему выдаст тебе судьба.
"""

PAYMENT_ERROR_MESSAGE = """
Что-то пошло не так с оплатой... Уверена, что это минус вайб твоего бывшего 
ерепенится! Но ничего - попробуй еще раз. Если вдруг не получится - напиши 
на почту.\n\n
Не сдавайся!
"""

GENDER_SELECTION_MESSAGE = """
Какого пола твой бывший? У меня всего два, не обессудь.
"""

INSULT_LIMIT_MESSAGE = """
Лимит на сегодня исчерпан! Приходи завтра за новой порцией 😈
"""

WAITING_FOR_MEDIA_MESSAGE = """
📩 Пришлите медиафайл (кружок, видео, аудио, фото, стикер), который хотите разослать.\n
❗ Подпись (caption) для стикеров и видео кружков будет проигнорирована — отправится только сам файл.
"""

START_COMMAND_CAPTION = """Пирожок, жми сюда скорее!"""